<template>
  <div>
    <div class="flex">
      <div class="mx-auto text-gray-500 mb-8">Libere sua compra rapidamente pagando com o Pix!</div>
    </div>

    <div class="flex flex-col gap-4">
      <div class="flex gap-4">
        <div class="p-4 bg-white rounded-xl flex flex-col justify-center items-center gap-2 border border-gray-300 w-1/2">
          <svg xmlns="http://www.w3.org/2000/svg" width="32" height="33" viewBox="0 0 32 33" fill="none">
            <path
              d="M16 8.33321V16.3332L21.3333 18.9999M29.3333 16.3332C29.3333 23.697 23.3638 29.6665 16 29.6665C8.63621 29.6665 2.66667 23.697 2.66667 16.3332C2.66667 8.96941 8.63621 2.99988 16 2.99988C23.3638 2.99988 29.3333 8.96941 29.3333 16.3332Z"
              stroke="#939598" stroke-width="3" stroke-linecap="round" stroke-linejoin="round" />
          </svg>
          <h3 class="font-medium mb-0">Rápida aprovação</h3>
          <p class="text-gray-500 text-center">Pagamento em segundos, sem complicação.</p>
        </div>

        <div class="p-4 bg-white rounded-xl flex flex-col justify-center items-center gap-2 border border-gray-300 w-1/2">
          <svg xmlns="http://www.w3.org/2000/svg" width="32" height="33" viewBox="0 0 32 33" fill="none">
            <path
              d="M8.66667 8.99992H8.68M23.3333 8.99992H23.3467M8.66667 23.6666H8.68M17.3333 17.6666H17.3467M23.3333 23.6666H23.3467M22.6667 28.3333H28V22.9999M18.6667 22.3333V28.3333M28 18.9999H22M20.8 13.6666H25.8667C26.6134 13.6666 26.9868 13.6666 27.272 13.5213C27.5229 13.3934 27.7268 13.1895 27.8547 12.9386C28 12.6534 28 12.28 28 11.5333V6.46659C28 5.71985 28 5.34648 27.8547 5.06126C27.7268 4.81038 27.5229 4.60641 27.272 4.47858C26.9868 4.33325 26.6134 4.33325 25.8667 4.33325H20.8C20.0533 4.33325 19.6799 4.33325 19.3947 4.47858C19.1438 4.60641 18.9398 4.81038 18.812 5.06126C18.6667 5.34648 18.6667 5.71985 18.6667 6.46659V11.5333C18.6667 12.28 18.6667 12.6534 18.812 12.9386C18.9398 13.1895 19.1438 13.3934 19.3947 13.5213C19.6799 13.6666 20.0533 13.6666 20.8 13.6666ZM6.13333 13.6666H11.2C11.9467 13.6666 12.3201 13.6666 12.6053 13.5213C12.8562 13.3934 13.0602 13.1895 13.188 12.9386C13.3333 12.6534 13.3333 12.28 13.3333 11.5333V6.46659C13.3333 5.71985 13.3333 5.34648 13.188 5.06126C13.0602 4.81038 12.8562 4.60641 12.6053 4.47858C12.3201 4.33325 11.9467 4.33325 11.2 4.33325H6.13333C5.3866 4.33325 5.01323 4.33325 4.72801 4.47858C4.47713 4.60641 4.27316 4.81038 4.14532 5.06126C4 5.34648 4 5.71985 4 6.46659V11.5333C4 12.28 4 12.6534 4.14532 12.9386C4.27316 13.1895 4.47713 13.3934 4.72801 13.5213C5.01323 13.6666 5.3866 13.6666 6.13333 13.6666ZM6.13333 28.3333H11.2C11.9467 28.3333 12.3201 28.3333 12.6053 28.1879C12.8562 28.0601 13.0602 27.8561 13.188 27.6052C13.3333 27.32 13.3333 26.9467 13.3333 26.1999V21.1333C13.3333 20.3865 13.3333 20.0131 13.188 19.7279C13.0602 19.477 12.8562 19.2731 12.6053 19.1452C12.3201 18.9999 11.9467 18.9999 11.2 18.9999H6.13333C5.3866 18.9999 5.01323 18.9999 4.72801 19.1452C4.47713 19.2731 4.27316 19.477 4.14532 19.7279C4 20.0131 4 20.3865 4 21.1333V26.1999C4 26.9467 4 27.32 4.14532 27.6052C4.27316 27.8561 4.47713 28.0601 4.72801 28.1879C5.01323 28.3333 5.3866 28.3333 6.13333 28.3333Z"
              stroke="#939598" stroke-width="3" stroke-linecap="round" stroke-linejoin="round" />
          </svg>
          <h3 class="font-medium mb-0">Facilidade na finalização</h3>
          <p class="text-gray-500 text-center">Basta escanear, com o aplicativo do seu banco, o QRCode que iremos gerar
            para sua compra.</p>
        </div>
      </div>
      <div class="flex gap-4">

        <div class="p-4 bg-white rounded-xl flex flex-col justify-center items-center gap-2 border border-gray-300 w-1/2">
          <svg xmlns="http://www.w3.org/2000/svg" width="32" height="33" viewBox="0 0 32 33" fill="none">
            <path
              d="M15.0693 29.1531C15.3645 29.3253 15.5121 29.4115 15.7204 29.4561C15.8821 29.4908 16.1179 29.4908 16.2796 29.4561C16.4879 29.4115 16.6355 29.3253 16.9306 29.1531C19.528 27.6378 26.6667 22.8779 26.6667 16.3333V11.2666C26.6667 9.83477 26.6667 9.11885 26.4459 8.61064C26.2216 8.0941 25.9981 7.81932 25.5381 7.49451C25.0854 7.17494 24.1982 6.9904 22.4236 6.62133C20.4677 6.21455 18.9657 5.48002 17.5925 4.41773C16.934 3.90832 16.6048 3.65362 16.3471 3.58415C16.0752 3.51085 15.9247 3.51085 15.6529 3.58415C15.3952 3.65362 15.066 3.90832 14.4075 4.41773C13.0343 5.48002 11.5323 6.21455 9.57639 6.62133C7.80183 6.9904 6.91454 7.17494 6.46192 7.49451C6.00189 7.81932 5.77838 8.0941 5.55404 8.61064C5.33333 9.11885 5.33333 9.83477 5.33333 11.2666V16.3333C5.33333 22.8779 12.4719 27.6378 15.0693 29.1531Z"
              stroke="#939598" stroke-width="3" stroke-linecap="round" stroke-linejoin="round" />
          </svg>
          <h3 class="font-medium mb-0">Maior segurança</h3>
          <p class="text-gray-500 text-center">O PIX foi desenvolvido pelo Banco Central para facilitar suas compras e é
            100% seguro.</p>
        </div>

        <div class="p-4 bg-white rounded-xl flex flex-col justify-center items-center gap-2 border border-gray-300 w-1/2">
          <svg xmlns="http://www.w3.org/2000/svg" width="32" height="33" viewBox="0 0 32 33" fill="none">
            <path
              d="M28 13.6665H4M21.3333 2.99988V8.33321M10.6667 2.99988V8.33321M10.4 29.6665H21.6C23.8402 29.6665 24.9603 29.6665 25.816 29.2306C26.5686 28.8471 27.1805 28.2352 27.564 27.4825C28 26.6269 28 25.5068 28 23.2665V12.0665C28 9.82633 28 8.70623 27.564 7.85058C27.1805 7.09793 26.5686 6.48601 25.816 6.10252C24.9603 5.66654 23.8402 5.66654 21.6 5.66654H10.4C8.15979 5.66654 7.03969 5.66654 6.18404 6.10252C5.43139 6.48601 4.81947 7.09793 4.43597 7.85058C4 8.70623 4 9.82633 4 12.0665V23.2665C4 25.5068 4 26.6269 4.43597 27.4825C4.81947 28.2352 5.43139 28.8471 6.18404 29.2306C7.03969 29.6665 8.15979 29.6665 10.4 29.6665Z"
              stroke="#939598" stroke-width="3" stroke-linecap="round" stroke-linejoin="round" />
          </svg>
          <h3 class="font-medium mb-0">Tranquilidade na renovação</h3>
          <p class="text-gray-500 text-center">A cada renovação da assinatura enviaremos um código PIX. Assim, você fica
            sempre em dia sem se preocupar.</p>
        </div>
      </div>
    </div>
  </div>
</template>
